package les1;

//Вывести на экран текст «Silence is golden». Каждое слово должно быть на новой строке.

public class Pract1task1 {

	public static void main(String[] args) {
        System.out.println("Silence\nis\ngolden");
	}

}